 # редици (tuple)

fn=(1234,1235,1236,1237)
imena=('Иван','Мария','Ники','Павел')
disc_1=('ОП','ОП','ОП','ОП')
grades_1=(4,5,6,3)
disc_2=('ООП','ООП','ООП','ООП')
grades_2=(4,4,6,6)


# Да се направи речник с ключове fn, и стойности- речник от останалите променливи
# {1234:{'imena':'Иван','ОП':4,'ООП':4},
#  1235:{'imena':'Мария','ОП':5,'ООП':4},..}
d=dict()
for k in range(len(fn)):
    d[fn[k]]=dict()
    d[fn[k]]['imena']=imena[k]
    d[fn[k]][disc_1[k]]=grades_1[k]
    # създаваме ключ, който се казва така, както се казва:
    # disc_1[k]
    # и е поредната дисциплина от редицата disc_1
    # и има стойност равна на поредния елемент от grades_1
    d[fn[k]][disc_2[k]] = grades_2[k]
for i in d.items():
    print(i)

d2 = dict()
for k in range(len(fn)):
    # k е поредния индекс от fn
    d2[fn[k]] = dict()
    # за всеки елемент от редицата трябва да създадем речник със ключ фак.номер и стойност речник
    # d2[fn[k]] представлява създаване на ключа (фак.номер) и задаване на стойността за този ключ като празен речник

    # запълване на стойността-празен речник:
    d2[fn[k]]['imena'] = imena[k] # създаваме ключ 'imena' и стойност за ключа поредното име от редицата imena
    d2[fn[k]]['disc_1'] = disc_1[k] # създаваме ключ 'disc_1' и стойност за ключа поредното име от редицата disc_1
    d2[fn[k]]['grades_1'] = grades_1[k] # създаваме ключ 'grades_1' и стойност за ключа поредното име от редицата grades_1
    d2[fn[k]]['disc_2'] = disc_1[k] # създаваме ключ 'disc_2' и стойност за ключа поредното име от редицата disc_2
    d2[fn[k]]['grades_2'] = grades_2[k] # създаваме ключ 'grades_2' и стойност за ключа поредното име от редицата grades_2

for i in d2.items():
    # d2.items() върща редица с два елемента: ключ, стойност
    print(i)

d3=dict()
for k in range(len(fn)):
    d3[fn[k]] = [imena[k],{disc_1[k]:grades_1[k],disc_2[k]:grades_2[k]}]


for i in d3.items():
    print(i)







