# Да се напише функция, която има два входни параметъра:
# списък от числа L и реално число N. Тя връща като резултат
# списък от тези числа от списъка L, които са по- големи от N.
#
# Демонстрирайте приложението на тази функция, като въведете списък
# L от произволни числа от клавиатурата, след което въведете реално число N,
# и след като приложите функцията, изведете на екрана полученият резултат.


L= [12,2,3,123,35,10]
N=50

# Вариант 1:
mylam=lambda x: x>N
res=list(filter(mylam,L))
print(res)

# Вариант 2:
new_L=[l for l in L if l>N]
print(new_L)