# Да се напише функция, която по подаден стринг и цяло число N,
# връща кодиран стринг. Кодираният стринг се формира по следния начин:
# всеки пореден символ от кодирания стринг има код на вътрешно представяне,
# равен на остатъка от делението на произведението на N и кода на вътрешното
# представяне на поредния символ от дадения елемент, с числото 256 .


my_string="abc"
N=5

def func(st,n):
    new_s=""
    for s in st:
        new_s+=chr((n*ord(s))%256)
    return(new_s)

print(func(my_string,N))








