# Да се напише функция с четири входни параметъра:
# списък от числа L, индекс, коефициент, степен.
# Функцията да връща като резултат числото: (L[индекс]+коефициент)**степен .
# Приложете функцията за всички елементи на даден списък от числа, въведен от клавиатурата,
# и изведете на екрана всички получени числа.

# въвеждаме списък от числа, разделени с интервал без да правим последваща проверка
L=input("Въведете списък от числа, разделени с интервал: ")
L=[float(l) for l in L.split()]

# Вариант 1:
p,k=2,3
myf=lambda l:round((l+k)**p,2)
new_L=list(map(myf,L))
print(new_L)

# Вариант 2:
def full(lis,ind,pow=2,koef=3):
    return round((lis[ind]+koef)**pow,2)
new_fl=[full(L,i) for i in range(len(L))]
print(new_fl)