# Да се напише функция, която има три входни параметъра:
# списък от цели числа L и цели числа М и N. Тя връща като
# резултат списък от числа, които се получават по следния начин: всяко
# поредно число е равно на остатъка от деленето на M на произведението от
# поредното число от списъка L и N. Демонстрирайте приложението на тази функция,
# като въведете списък L от цели числа от клавиатурата, след което въведете цели
# числа M и N, и след като приложите функцията, изведете на екрана полученият резултат.

def fuc (L, M, N):

    #ostatuka ot delenieto na M
    #proizvedenieto ot porednoto chislo ot L i N

    output = []

    for index, num in enumerate (L):
        result = M% (L[index]*N)

        output.append(int(result))
    return output

listL = [int(item) for item in input ("Въведете списък от числа: ").split()]
M = int(input("Въведете число М: "))
N = int(input("Въведете число N: "))

print(fuc(listL, M, N))


