# 1. Да се напише функция, която получава един входен параметър от тип списък,
# и връща като резултат нов списък като:
# • проверява дали поредният елемент от входният списък е стринг:
#       ако е стринг, то в списъка-резултат се добавя нов елемент стринг,
#       който се получава като добавим символа “@“ в началото на стринга от входния списък
# • проверява дали поредният елемент от входният списък е число:
#       ако е число, то в списъка резултат се добавя число,
#       което се получава като към числото от входния списък добавим числото,
#       равно на кода на вътрешното представяне на символа “@“.
# • във всички останали случаи на елемент от входния списък, записваме в списъка-резултат,
#   като пореден елемент числото нула.

# Вариант 1:
my_list = [1,2,3,'1','2','3',10.5,[1,2,3]]
def my_function(L):
    new_L=[]
    for l in L:
        if isinstance(l,str):new_L.append('@'+l)
        elif (isinstance(l,float) or isinstance(l,int)): new_L.append(l+ord('@'))
        else: new_L.append(0)
    return new_L

print(my_function(my_list))

# Вариант 2:
def myf(a):
    if isinstance(a,str):return '@'+a
    elif (isinstance(a,float) or isinstance(a,int)): return a+ord('@')
    else: return 0

myl=list(map(myf,my_list))
print(myl)
