# Дадена е един стринг,
# обърнете го редица,
# да се премахнат всички букви 'a' от редицата:
# -или да превърнем в списък
# -празна редица и конкатениране, ползваме цикъл
# да се подменят всички букви 'o' със 0
# преобразувайте отново в стринг

# s='Баба Марта ми донесе много мартенички'
# st=tuple(s)
# newt='!',
# for i in range(len(st)):
#     cond_1=st[i]!='а'
#     cond_2=st[i]=='о'
#     if cond_1 and cond_2: newt+=tuple('0')
#     if cond_1 and not cond_2: newt+=tuple(st[i])
#
# st=newt[1::]
# s=''.join(st) # функцията join може да се използва за слепване както на списъци, така и на редици
# del(newt)
# print(s)

# Методи за списъци:
# dl=[7, 2, 5, 5, 7, 2, 3, 4, 3]
# ds=list(set(dl)) #този списък всъщност е СОРТИРАНО множество от уникалните елементи на dl
# di={}
# dnew=[]
# for i in ds:
#     # di[i]=dl.count(i)
#     dnew.extend([i]*dl.count(i))
# # print(di)
# # dl.clear()
# # for k,v in di.items():
# #     dl.extend([k]*v)
# # print(dl)
#
# #по този начин запазваме id-to на dl и копираме стойностите от сортирания списък
# dl.clear()
# dl.extend(dnew)
# del(dnew)
# print(dl)

# Сортиране на списъци:
# dl.sort() # променя подредбата на елементите в списъка
# dl=sorted(dl) # променя подредбата на елементите в списъка
# sorted(dl) # показва подредбата, но не променя списъка

# Пакетиране на стойности
names=['Василена',"Васка","Андреас",'Виолета']
fnames=["Василева","Петакова","Тинев","Секулова"]
fn=[12,13,15,18]

students=zip(fn,names,fnames)
for i in students:
    print(i)
    f,n,fm=i
    print('Факултетен номер: %d, %s %s' %(f,n,fm))

# Пакетирано създаване на променливи: пакетна променлива= няколко изброени променливи
A=2, 3
B=4, 5
points=A,B
C,D=points
x1,y1=C
x2,y2=D
print((x1,x2))
print((y1,y2))
