import random as rd

# създайте списък от 10 цели случайни числа в интервала [10;20]
# сортирайте списъка в намялващ ред
# изведете първите три най-големи числа от списъка

L=[]
for i in range(10):
    L.append(rd.randint(10,20))
# L=[rd.randint(10,20) for i in range(10)] # алтерантивен запис за създаване и запълване на списък
# команда for израз за управлението на цикъла условие:
# k=[i for i in range(21) if i%2==0] # създава списък с четните числа от 0 до 20
# m=list(range(21))[::2] # създава списък с четните числа от 0 до 20
# k и m реално имат едни и същи елементи
print(L)
L.sort(reverse=True)
# L.sort() - сортира в нарастващ ред, защото по подразбиране reverse=False
# L.sort(reverse=True) - сортира в намаляващ ред
print(L)
print('Първите три най-големи елемента са: ', L[:3])
# L[start_index=0,stop_index=len(L),step=1]

# Редици
names=('Анжела', 'Рая','Ники')
fn=(123,124,125)
data=zip(fn,names) # обект, чиито елементи не можем да достъпим по индекс
datal=list(data) # конвертираме към списък и получаваме списък от редици с формат (dn, names)
datal[1][0] # за редица с индес 1, взимаме факултетния номер, който според форматирането е винаги с индекс 0


# Първата задача, но направена с редици:
t=() # празна редица
for i in range(10):
    t+=(rd.randint(10,20),)
# към съществуващата редица залепяме нова
print(t)
unical_el=list(set(t))#set преобразува в множество от уникални елементи
unical_el.sort(reverse=True)
# unical_el са сортираните уникални елементи под формата на списък

t2=()
for i in unical_el:
    t2+=(i,)*t.count(i)
print(t2)
print(t2[:3])