# 1. Чиновник работи в магазин, където цената на всеки артикул е положително цяло число лева.
#
# Така например, нещо може да струва 21 лв., но нищо не може да струва лева и стотинки.
# За да върне ресто, служителят има неограничен брой банкноти и монети във всяка от
# следните деноминации: 1 лв., 2 лв., 5 лв., 10 лв. и 20 лв.. Напишете функция, която
# взема два аргумента (цената на артикул и платената сума) и отпечатва как да бъде върнато
# рестото, като използвате възможно най-малък брой банкноти и монети.
#
def zad1():
    bank=[1,2,5,10,20]
    bank=bank[::-1]
    # bank=[20,10,5,2,1]
    import random as rd
    smetka=rd.randint(1,100)
    klient=smetka+rd.randint(1,30)
    resto=klient-smetka
    print('Сметката е: '+str(smetka)+' Клиентът дава: '+str(klient)+' рестото е: '+str(resto))
    d={}
    while resto>0:
        for b in bank:
            if b<=resto:
                d[b] = resto // b
                resto=resto-b*(resto//b)
                break # за да можем да излезем от for при намирането на подходящ елемент
    for k in d.items():
        print(k)

# 2. Напишете функция, която взема поредица от думи, разделени с интервали
# (не допускайте препинателни знаци или главни букви), заедно с „целева“
# дума и показва позицията на целевата дума в низа от думи. Например, ако низът е:
# * ние не се нуждаем от образование ние не се нуждаем от контрол на мисълта ние не се нуждаем
# и целта е думата "не", тогава вашата функация трябва да върне списъка 1, 7, 15, защото "не"
# се появява на 1-ва, 7-та и 15-та позиция в низа. Вашата функция трябва да върне False, ако
# целевата дума не се появи в низа.

te=input('Въведете символен низ от думи, написани с малки букви и разделител интервал, без препинателни знаци:\n')
target=input('Въведете дума, написана с малки букви, която да бъде открита: ')

def checkstr(text,search_in_text):
    l=text.split()
    positions=[k for k in range(len(l)) if l[k]==search_in_text]
    if len(positions)==0: positions=False
    return positions

print(checkstr(te,target))