# Задача за разбъркване на един символен низ

import random
s = input('Въведете символен низ: \n')
# s='Баба Марта ми донесе много мартенички'
newS = ""

# n- дължината на стринга, i- итератор в цикъла
n = len(s)
l=[]
# списъкът а служи за маркиране на вече извлечените на случаен принцип символи
while len(newS) < n:
    rnd = random.randint(0,n-1)
    symbol = s[rnd]
    if rnd not in l:
        newS = newS + symbol
        l.append(rnd)
print(newS)

ppp="a in b връща TRue ако а се съдържа във b\n"
ppp+= "a in b връща False ако а не се съдържа във b"
ppp+= "a not in b връща True ако а не се съдържа във b"
ppp+= "a not in b връща False ако а се съдържа във b"
ppp+= "където b може да бъде списък, множество или ключове от речник"
ppp+= "където а може да бъде елемент от списък, множество или ключ от речник\nКрай на текста"
print(ppp)