#zad. 2
t="Тази вечер ще празнуваме"

#2.1  Като използвате слайсинг методите
#изведете различни части от него
print(t[0:4])
print(t[-1])
print(t[5:10])
print(t[::-1])

#2.2 Разпечатайте променливата така че
#да има по един символ на ред
for i in range (len(t)):
    print(t[i])

#2.3 Разпечатайте променливата отзад
#напред: чрез слайсинг, чрез цикъл
print(t[::-1])                          # чрез слайсинг
for i in range (-1,-len(t)-1,-1):       # чрез цикъл
    print(t[i],end="")
print()

#2.4 Преведете стринга на пилшки език
#чрез стринг “пи”, като буквите от стринга
#са капитализирани (методи .capitalize() и
#.upper() )
v="пи"
p=t.upper()
for i in p:
    v+=i+"пи"
v=v[:-2]
print(v)

#2.5 Направете честотен речник за стринга,
#който показва коя буква колко пъти се среща
#( метод .count() и форматиране на стрингове)
d=t.lower()
abc=[chr(i) for i in range(1072,1104)]
abc="".join(abc)
for a in abc:
    txt="%s: %d" %(a,d.count(a))
    if d.count(a)>0:
        print(txt)
