# Ако е дадена фраза на български (може да бъдат две или повече думи написани слято),
# която не съдържа други символи и цифри, освен интервали !!!
# Напишете програма, която изписва с латински букви същата дума. При конвертирането:
# да се заменят с цифри от 0 до 9 буквите [о,и,д,е,ч,п,ш,т,ъ,щ] и символите @ и ! за буквите “а”,”л”


bg=set([chr(i)for i in range(ord('а'),ord('я')+1)])
bg.add(chr(32))
bg_az={'а':'@','б':'b','в':'v','г':'g','д':'2','е':'3','ж':'zh','з':'z','и':'1','й':'j','к':'k','л':'!','м':'m','н':'n','о':'0','п':'5','р':'r','с':'s','т':'7','у':'u','ф':'f','х':'h','ц':'c','ч':'4','ш':'6','щ':'9','ь':'x','ъ':'8','ю':'yu','я':'ya',chr(32):'%'}
str=input('Please input password, written in bg alphabet only:')
str=[s.lower() for s in str] # сплитваме фразата под формата на списък
new_str=set(str)
if new_str<bg: # Проверяваме дали всички символи от фразата са български
    newpass = ''
    for i in str:
      newpass+=bg_az[i]
    print(newpass)
else: print('Стрингът не е на български език!')
print('Край на програмата.')


