# зад.6 Напишете програма, която при въвеждане на рождена дата (само деня и месеца се използват),
# да изчислява личната година според нумерологията, ако знаете че:
# личната година=сбор от цифрите на въведения месец+сбор от цифрите на въведения ден +сбор от цифрите на текущата година
# Полученото се редуцира докато не стане 11,22,33,44...
# или едноцифрено Според получената лична година изведете подходяща прогноза
# като използвате например данните от този сайт: http://umaybg.com/?p=17

s=input('Въведете ден и месец на раждане във формат ДД.ГГГГ: ')
cond_1=len(s)==7
cond_2=s[2]="."
cond_3=s[:2].isalnum()
cond_4=s[3:].isalnum()

if cond_1 and cond_2 and cond_3 and cond_4:
    pers_year=0
    pers_year=int(s[0])+int(s[1])+int(s[3])+int(s[4])+int(s[5])+int(s[6])
