# Да се напише програма, която извежда TRUE , ако в записа на положително четирицифрено число,
# всички цифри са различни, и FALSE - в противен случай. При въвеждане на число,
# което не съответства на условието да се извежда съобщение за грешка
# (например: ако е въведено три цифрено число, реално число, текст...)

number=input('Въведи цяло число 4-цифрено число: ') # това реално е стринг
if len(number)==4:
    try:
        int(number) # ако секцията try се изпълни успешно => е въведено число
        a = set()  # дефинираме едно празно множество a
        for i in number:  # добавяме всеки символ от number в множеството a
            a.add(i)
        print(a)
        if len(a) == 4:
            print("TRUE")  # ако имаме 4 елемента в множеството, това задължително означава, че те са различни
        else:
            print(
                "FALSE")  # ...защото едно от свойствата на множествата е, че всички елементи в едно множество са различни
    except:
        print("Това не е число!")
else:
    print("Дължината на въведеното не е 4 символа.")

print("Край на програмата")

