# Това е коментар. КОментарите винаги започват със знака диез #
# В Python подреждането и отместването ИМА ЗНАЧЕНИЕ
# Python прави разлика между малки и големи букви, между букви на латиница и кирилица

# Няколко кратки примера:
a=list(range(1,10))
b=[x for x in range(1,10)]
d=[1,2,3,4,5,6,7,8,9]

print(a)
print(b)
print(d)

# Няма разлика между a,b и d

for i in a:
    # двуеточието означава, че започва нов блок от команди, които ще се изпълняват в един и същ цикъл
    # в случая, променливата i всеки път ще взема следващата стойност от списъка с числа a
    # s e стрингова променлива, т.е. съдържа някакъв текст, знакът + се използва за залепване на стрингове
    # str() е функия, която представя число под формата на текст
    # двете команди по-долу образуват блок от команди. Блокът от каманди е винаги еднакво подравнен от ляво
    s="a["+str(i-1)+"]="+str(i)
    print(s)

print("КРАЙ на програмата")
# Тази команда е извън блока, и затова се изпълнява само веднъж